In [11]:
import numpy as np
import pandas as pd
df= pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
print(df)

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [4]:
# Some values in the the FlightNumber column are missing. These numbers are meant
#to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
#these missing numbers and make the column an integer column (instead of a floatcolumn).

import numpy as np
import pandas as pd
df= pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [16]:
# Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. 
# Standardise the strings so that only the first letter is uppercase (e.g."londON" should become "London".)

import numpy as np
import pandas as pd

temp_data = df.From_To.str.capitalize()
temp_data

0        London_paris
1        Madrid_milan
2    London_stockholm
3      Budapest_paris
4     Brussels_london
Name: From_To, dtype: object

In [31]:
# Delete the From_To column from df and attach the temporary DataFrame from theprevious questions.
df.drop('From_To', axis=1)

               Airline  FlightNumber  RecentDelays
0               KLM(!)       10045.0      [23, 47]
1    <Air France> (12)           NaN            []
2  (British Airways. )       10065.0  [24, 43, 87]
3       12. Air France           NaN          [13]
4          "Swiss Air"       10085.0      [67, 32]

In [77]:
#Delete the From_To column from df and attach the temporary DataFrame from the previous questions.
df= pd.DataFrame({'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
temp_data = ('London_paris','Madrid_milan','London_stockholm','Budapest_paris','Brussels_london')
df['data'] = temp_data
print(df)

               Airline  FlightNumber  RecentDelays              data
0               KLM(!)       10045.0      [23, 47]      London_paris
1    <Air France> (12)           NaN            []      Madrid_milan
2  (British Airways. )       10065.0  [24, 43, 87]  London_stockholm
3       12. Air France           NaN          [13]    Budapest_paris
4          "Swiss Air"       10085.0      [67, 32]   Brussels_london

In [80]:
#In the RecentDelays column, the values have been entered into the DataFrame as a
#list. We would like each first value in its own column, each second value in its own
#column, and so on. If there isn't an Nth value, the value should be NaN.
#Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,
#delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

import pandas as pd
import numpy as np

df['delay_1']= pd.Series([23, 47])
df['delay_2']= pd.Series([])
df['delay_3']= pd.Series([24, 43,87])
df['delay_4']= pd.Series([13])
df['delay_5']= pd.Series([67,32])



print(df)

               Airline  FlightNumber  RecentDelays              data  delay_1  \
0               KLM(!)       10045.0      [23, 47]      London_paris     23.0
1    <Air France> (12)           NaN            []      Madrid_milan     47.0
2  (British Airways. )       10065.0  [24, 43, 87]  London_stockholm      NaN
3       12. Air France           NaN          [13]    Budapest_paris      NaN
4          "Swiss Air"       10085.0      [67, 32]   Brussels_london      NaN

   delay_2  delay_3  delay_4  delay_5
0      NaN     24.0     13.0     67.0
1      NaN     43.0      NaN     32.0
2      NaN     87.0      NaN      NaN
3      NaN      NaN      NaN      NaN
4      NaN      NaN      NaN      NaN

In [56]:
#The From_To column would be better as two separate columns! Split each string on
#the underscore delimiter _ to give a new temporary DataFrame with the correct values.
#Assign the correct column names to this temporary DataFrame.

import numpy as np
import pandas as pd



df['From'] = df.From_To.str.split('_').str.get(0)
df['To'] = df.From_To.str.split('_').str.get(1)
print(df)

            From_To start end      From         To         1          2
0      LoNDon_paris              LoNDon      paris    LoNDon      paris
1      MAdrid_miLAN              MAdrid      miLAN    MAdrid      miLAN
2  londON_StockhOlm              londON  StockhOlm    londON  StockhOlm
3    Budapest_PaRis            Budapest      PaRis  Budapest      PaRis
4   Brussels_londOn            Brussels     londOn  Brussels     londOn